import { defineStore } from "pinia";
import useApi from "~/server/useApi";
import baseUrls from "~/server/useApi/baseUrls";

export const useStore = defineStore("store", () => {

    const navMenu = ref([]);

    const carousel = ref([]);

    const articles = ref([
        {
            "id": 1,
            "title": "چالش‌های ایمنی در محل کار",
            "descr": "ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است.",
            "link": "/article/1",
            "poster": "../../assets/images/ar1.jpg",
            "text": "ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است. هرچند که بسیاری از سازمان‌ها تلاش می‌کنند تا محیطی ایمن و سالم برای کارمندان خود فراهم کنند، اما همچنان با چالش‌های متعددی مواجه هستند که می‌تواند تأثیرات زیادی بر سلامت و امنیت افراد داشته باشد.\n\n۱. عدم آگاهی و آموزش\n\nیکی از بزرگترین چالش‌ها در حوزه ایمنی محل کار، عدم آگاهی و آموزش کارکنان است.بسیاری از افراد در زمینه خطرات احتمالی و روش‌های ایمن کار کردن آگاهی کافی ندارند.این مسئله می‌تواند منجر به حوادث و آسیب‌های جدی شود.بنابراین، برگزاری مقاطع آموزشی منظم و مستمر برای کارکنان ضروری است.\n\n۲. شرایط فیزیکی نامناسب\n\nمحیط کار باید از نظر فیزیکی ایمن و مناسب باشد.وجود سطوح لغزنده، تجهیزات فرسوده یا ناکافی و عدم وجود روشنایی مناسب می‌تواند خطرات جدی به همراه داشته باشد.سازمان‌ها باید به زیرساخت‌های خود توجه کنند و اطمینان حاصل کنند که محیط کار، طبق استانداردهای ایمنی طراحی و نگهداری می‌شود.\n\n۳. فشار کاری و استرس\n\nفشار کاری زیاد و استرس می‌تواند تأثیر منفی بر روی سلامت روانی و جسمی کارکنان داشته باشد.در این شرایط، خطرات حوادث کاری افزایش می‌یابد.مدیریت زمان و حجم کار، همانند ایجاد فضایی مثبت و حمایتی می‌تواند در کاهش استرس و بهبود ایمنی مؤثر باشد.\n\n۴. فرهنگ ایمنی\n\nایجاد یک فرهنگ ایمنی قوی در سازمان‌ها نیازمند تلاش و همکاری همگانی است.اگر کارکنان احساس کنند که ایمنی برای مدیریت یا همکارانشان اهمیت ندارد، احتمال اینکه خودشان نیز به اصول ایمنی پایبند باشند، کاهش می‌یابد.بنابراین، بهبود فرهنگ ایمنی باید از بالاترین سطوح سازمان آغاز شود.\n\n۵. تغییرات در تکنولوژی\n\nتوسعه و تغییر در تکنولوژی می‌تواند باعث ایجاد چالش‌های جدید در زمینه ایمنی شود.مثلاً، استفاده از ماشین‌آلات و تجهیزات جدید ممکن است نیاز به بررسی و آموزش‌های جدید داشته باشد.به همین دلیل، سازمان‌ها باید در راستای تطابق با فناوری‌های نوین، برنامه‌های آموزشی و ایمنی خود را به‌روز کنند.\n\n    نتیجه‌گیری\n\nچالش‌های ایمنی در محل کار می‌توانند به اشکال مختلف نمایان شوند، اما توجه به این چالش‌ها و اجرای راهکارهای مؤثر می‌تواند ایمنی و سلامت کارکنان را بهبود بخشد.ایجاد محیطی ایمن و حمایت‌گر نه تنها به حفظ سلامتی کارکنان کمک می‌کند بلکه بر کارایی و بهره‌وری سازمان نیز تأثیر مثبت خواهد گذاشت.در نهایت، حفظ ایمنی در محل کار باید به‌عنوان یک اولویت‌ اصلی در همه سازمان‌ها در نظر گرفته شود."
        },
        {
            "id": 2,
            "title": "ایمنی در ورزش: راهنمایی برای فعالیت‌های سالم",
            "descr": "ایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد.",
            "link": "/article/2",
            "poster": "../../assets/images/ar2.jpg",
            "text": "ورزش یکی از بهترین راه‌ها برای حفظ سلامتی جسمی و روحی است، اما برای بهره‌مندی حداکثری از آن، توجه به ایمنی بسیار اهمیت دارد. در این مقاله، به بررسی نکات کلیدی برای ایمنی در ورزش خواهیم پرداخت.\n\n اهمیت ایمنی در ورزش\n\nایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد. با رعایت اصول ایمنی، می‌توان از بروز آسیب‌های جدی و غیرضروری جلوگیری کرد.\n\n انتخاب محیط مناسب\n\nانتخاب محیط مناسب برای ورزش یکی از ابتدایی‌ترین نکات ایمنی است. فضای ورزشی باید تمیز، بدون موانع و با تجهیزات مناسب باشد. زمین‌های ورزشی باید نرم و بدون سنگ و خرده شیشه باشند تا در صورت سقوط، آسیب کمتری به ورزشکار وارد شود.\n\n استفاده از تجهیزات ایمنی\n\nاستفاده از تجهیزات ایمنی مناسب می‌تواند خطر آسیب را به طرز چشمگیری کاهش دهد. برای مثال:\n- در ورزش‌هایی مانند دوچرخه‌سواری، کلاه ایمنی بهترین راه برای حفاظت از سر است.\n- در ورزش‌های رزمی، استفاده از دستکش‌ها و محافظ‌های بدن می‌تواند از آسیب‌های جدی جلوگیری کند.\n\n گرم کردن و سرد کردن\n\nگرم کردن قبل از ورزش و سرد کردن بعد از آن، بسیار حائز اهمیت است. گرم کردن به بدن کمک می‌کند تا به تدریج به فعالیت‌های ورزشی عادت کند و از بروز کشیدگی و آسیب‌های عضلانی جلوگیری می‌کند. سرد کردن نیز به بازگشت قلب و عضلات به حالت اولیه کمک می‌کند و خطر آسیب‌ها را کاهش می‌دهد."
        }
    ]
    );

    const { get } = useApi();

    const getNavMenu = async () => {
        try {
            await get(`${baseUrls[1].url}navmenu`)
            .then(response => navMenu.value = response.data);
        } catch (e) {
            console.log("err")
        }
    }

    const getCarousel = async () => {
        try {
            await get(`${baseUrls[2].url}carousel`)
            .then(response => carousel.value = response.data);
        } catch (e) {
            console.log("err")
        }
    }


    return { articles, navMenu, carousel, getNavMenu, getCarousel };
})