import { defineStore } from "pinia";

export const useStore = defineStore("store", () => {

    const navMenu = ref([
        { id: 1, title: "صفحه نخست", path: "/", sublinks: [] },
        {
            id: 2, title: "آموزش", path: "#", sublinks: [
                {
                    id: 1, title: "مقالات آموزشی", path: "#", sublinks: [
                        { id: 1, title: "ایمنی رانندگان و مسافران", path: "/ایمنی رانندگان و مسافران" },
                        { id: 2, title: "ایمنی جاده", path: "/ایمنی جاده" },
                        { id: 3, title: "ایمنی وسایل نقلیه", path: "/ایمنی وسایل نقلیه" },
                        { id: 4, title: "ایمنی در ورزش", path: "/ایمنی در ورزش" },
                        { id: 5, title: "ایمنی در محیط کار و خانه", path: "/ایمنی در محیط کار و خانه" },
                    ]
                },
                {
                    id: 2, title: "چندرسانه‌ای", path: "#", sublinks: [
                        { id: 1, title: "فیلم", path: "/فیلم" },
                        { id: 2, title: "پمفلت", path: "/پمفلت" }
                    ]
                },
            ]
        },
        {
            id: 3, title: "تازه‌ها", path: "#", sublinks: [
                { id: 1, title: "حوادث", path: "/حوادث", sublinks: [] },
                { id: 2, title: "هوش مصنوعی در تروما و ایمنی", path: "/هوش مصنوعی در تروما و ایمنی", sublinks: [] },
            ]
        },
        { id: 4, title: "روز جهانی تروما", path: "/trauma-international-day", sublinks: [] },
        { id: 5, title: "درباره ما", path: "/about-us", sublinks: [] },
        { id: 6, title: "تماس با ما", path: "/تماس با ما", sublinks: [] }
    ])

    const carousel = ref([
        {
            id: 1,
            title: "چالش‌های ایمنی در محل کار",
            descr: "ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است. ",
            link: "/article/1",
            poster: "../../assets/images/ar1.jpg",
            text: `ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است. هرچند که بسیاری از سازمان‌ها تلاش می‌کنند تا محیطی ایمن و سالم برای کارمندان خود فراهم کنند، اما همچنان با چالش‌های متعددی مواجه هستند که می‌تواند تأثیرات زیادی بر سلامت و امنیت افراد داشته باشد.

۱. عدم آگاهی و آموزش

یکی از بزرگترین چالش‌ها در حوزه ایمنی محل کار، عدم آگاهی و آموزش کارکنان است.بسیاری از افراد در زمینه خطرات احتمالی و روش‌های ایمن کار کردن آگاهی کافی ندارند.این مسئله می‌تواند منجر به حوادث و آسیب‌های جدی شود.بنابراین، برگزاری مقاطع آموزشی منظم و مستمر برای کارکنان ضروری است.

۲. شرایط فیزیکی نامناسب

محیط کار باید از نظر فیزیکی ایمن و مناسب باشد.وجود سطوح لغزنده، تجهیزات فرسوده یا ناکافی و عدم وجود روشنایی مناسب می‌تواند خطرات جدی به همراه داشته باشد.سازمان‌ها باید به زیرساخت‌های خود توجه کنند و اطمینان حاصل کنند که محیط کار، طبق استانداردهای ایمنی طراحی و نگهداری می‌شود.

۳. فشار کاری و استرس

فشار کاری زیاد و استرس می‌تواند تأثیر منفی بر روی سلامت روانی و جسمی کارکنان داشته باشد.در این شرایط، خطرات حوادث کاری افزایش می‌یابد.مدیریت زمان و حجم کار، همانند ایجاد فضایی مثبت و حمایتی می‌تواند در کاهش استرس و بهبود ایمنی مؤثر باشد.

۴. فرهنگ ایمنی

ایجاد یک فرهنگ ایمنی قوی در سازمان‌ها نیازمند تلاش و همکاری همگانی است.اگر کارکنان احساس کنند که ایمنی برای مدیریت یا همکارانشان اهمیت ندارد، احتمال اینکه خودشان نیز به اصول ایمنی پایبند باشند، کاهش می‌یابد.بنابراین، بهبود فرهنگ ایمنی باید از بالاترین سطوح سازمان آغاز شود.

۵. تغییرات در تکنولوژی

توسعه و تغییر در تکنولوژی می‌تواند باعث ایجاد چالش‌های جدید در زمینه ایمنی شود.مثلاً، استفاده از ماشین‌آلات و تجهیزات جدید ممکن است نیاز به بررسی و آموزش‌های جدید داشته باشد.به همین دلیل، سازمان‌ها باید در راستای تطابق با فناوری‌های نوین، برنامه‌های آموزشی و ایمنی خود را به‌روز کنند.

    نتیجه‌گیری

چالش‌های ایمنی در محل کار می‌توانند به اشکال مختلف نمایان شوند، اما توجه به این چالش‌ها و اجرای راهکارهای مؤثر می‌تواند ایمنی و سلامت کارکنان را بهبود بخشد.ایجاد محیطی ایمن و حمایت‌گر نه تنها به حفظ سلامتی کارکنان کمک می‌کند بلکه بر کارایی و بهره‌وری سازمان نیز تأثیر مثبت خواهد گذاشت.در نهایت، حفظ ایمنی در محل کار باید به‌عنوان یک اولویت‌ اصلی در همه سازمان‌ها در نظر گرفته شود. 
`
        },
        {
            id: 2,
            title: "ایمنی در ورزش: راهنمایی برای فعالیت‌های سالم",
            descr: "ایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد. ",
            link: "/article/2",
            poster: "../../assets/images/ar2.jpg",
            text: `ورزش یکی از بهترین راه‌ها برای حفظ سلامتی جسمی و روحی است، اما برای بهره‌مندی حداکثری از آن، توجه به ایمنی بسیار اهمیت دارد. در این مقاله، به بررسی نکات کلیدی برای ایمنی در ورزش خواهیم پرداخت.

 اهمیت ایمنی در ورزش

ایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد. با رعایت اصول ایمنی، می‌توان از بروز آسیب‌های جدی و غیرضروری جلوگیری کرد.

 انتخاب محیط مناسب

انتخاب محیط مناسب برای ورزش یکی از ابتدایی‌ترین نکات ایمنی است. فضای ورزشی باید تمیز، بدون موانع و با تجهیزات مناسب باشد. زمین‌های ورزشی باید نرم و بدون سنگ و خرده شیشه باشند تا در صورت سقوط، آسیب کمتری به ورزشکار وارد شود.

 استفاده از تجهیزات ایمنی

استفاده از تجهیزات ایمنی مناسب می‌تواند خطر آسیب را به طرز چشمگیری کاهش دهد. برای مثال:
- در ورزش‌هایی مانند دوچرخه‌سواری، کلاه ایمنی بهترین راه برای حفاظت از سر است.
- در ورزش‌های رزمی، استفاده از دستکش‌ها و محافظ‌های بدن می‌تواند از آسیب‌های جدی جلوگیری کند.

 گرم کردن و سرد کردن

گرم کردن قبل از ورزش و سرد کردن بعد از آن، بسیار حائز اهمیت است. گرم کردن به بدن کمک می‌کند تا به تدریج به فعالیت‌های ورزشی عادت کند و از بروز کشیدگی و آسیب‌های عضلانی جلوگیری می‌کند. سرد کردن نیز به بازگشت قلب و عضلات به حالت اولیه کمک می‌کند و خطر آسیب‌ها را کاهش می‌دهد.

 تمرینات مناسب

انتخاب تمرینات متناسب با سطح فیزیکی و توانایی‌های خود، از نکات کلیدی در ایمنی است. شروع با تمرینات سبک و افزایش تدریجی شدت و زمان تمرین، کمک می‌کند که بدن به تدریج به فشارهای ورزشی عادت کند.

 توجه به علائم بدن

هرگز نباید علائم خستگی یا دردهای غیرعادی را نادیده گرفت. در صورت احساسی از درد، خطر آسیب وجود دارد. هر ورزشکاری باید به واکنش‌های بدن خود توجه کند و در صورت نیاز، فعالیت را متوقف کند و به پزشک مراجعه نماید.

 مشاوره با متخصصان

برای افراد تازه‌کار یا کسانی که به ورزشی خاص علاقه‌مند هستند، مشاوره با مربی یا متخصص ورزشی می‌تواند مفید واقع شود. آن‌ها می‌توانند راهنمایی‌های لازم در زمینه تکنیک‌های صحیح انجام حرکات، انتخاب تجهیزات مناسب و برنامه‌ریزی برای تمرینات ارائه دهند.

 تغذیه مناسب

تغذیه صحیح قبل و بعد از ورزش می‌تواند به بهبود عملکرد و تسریع روند بهبودی کمک کند. مصرف مواد مغذی مناسب، هیدراتاسیون کافی و رعایت زمان‌های مناسب برای تغذیه، از نکات کلیدی در این زمینه هستند.

 نتیجه‌گیری

ایمنی در ورزش به معنای پیشگیری از آسیب‌ها و ارتقای کیفیت تمرینات است. با رعایت نکات فوق، می‌توان تجربه‌ای سالم و ایمن از ورزش داشت و از فواید سلامت‌ساز آن بهره‌مند شد. ورزش تنها زمانی لذت‌بخش و مؤثر است که با ایمنی همراه باشد؛ پس همواره باید این نکات را مد نظر قرار داد و با آگاهی و احتیاط به این فعالیت پرداخته شود.
`
        },
    ]);

    const articles = ref([
        {
            id: 1,
            title: "چالش‌های ایمنی در محل کار",
            descr: "ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است. ",
            link: "/article/1",
            poster: "../../assets/images/ar1.jpg",
            text: `ایمنی در محل کار یکی از عوامل کلیدی در تضمین بهره‌وری و رضایت شغلی کارکنان است. هرچند که بسیاری از سازمان‌ها تلاش می‌کنند تا محیطی ایمن و سالم برای کارمندان خود فراهم کنند، اما همچنان با چالش‌های متعددی مواجه هستند که می‌تواند تأثیرات زیادی بر سلامت و امنیت افراد داشته باشد.

۱. عدم آگاهی و آموزش

یکی از بزرگترین چالش‌ها در حوزه ایمنی محل کار، عدم آگاهی و آموزش کارکنان است.بسیاری از افراد در زمینه خطرات احتمالی و روش‌های ایمن کار کردن آگاهی کافی ندارند.این مسئله می‌تواند منجر به حوادث و آسیب‌های جدی شود.بنابراین، برگزاری مقاطع آموزشی منظم و مستمر برای کارکنان ضروری است.

۲. شرایط فیزیکی نامناسب

محیط کار باید از نظر فیزیکی ایمن و مناسب باشد.وجود سطوح لغزنده، تجهیزات فرسوده یا ناکافی و عدم وجود روشنایی مناسب می‌تواند خطرات جدی به همراه داشته باشد.سازمان‌ها باید به زیرساخت‌های خود توجه کنند و اطمینان حاصل کنند که محیط کار، طبق استانداردهای ایمنی طراحی و نگهداری می‌شود.

۳. فشار کاری و استرس

فشار کاری زیاد و استرس می‌تواند تأثیر منفی بر روی سلامت روانی و جسمی کارکنان داشته باشد.در این شرایط، خطرات حوادث کاری افزایش می‌یابد.مدیریت زمان و حجم کار، همانند ایجاد فضایی مثبت و حمایتی می‌تواند در کاهش استرس و بهبود ایمنی مؤثر باشد.

۴. فرهنگ ایمنی

ایجاد یک فرهنگ ایمنی قوی در سازمان‌ها نیازمند تلاش و همکاری همگانی است.اگر کارکنان احساس کنند که ایمنی برای مدیریت یا همکارانشان اهمیت ندارد، احتمال اینکه خودشان نیز به اصول ایمنی پایبند باشند، کاهش می‌یابد.بنابراین، بهبود فرهنگ ایمنی باید از بالاترین سطوح سازمان آغاز شود.

۵. تغییرات در تکنولوژی

توسعه و تغییر در تکنولوژی می‌تواند باعث ایجاد چالش‌های جدید در زمینه ایمنی شود.مثلاً، استفاده از ماشین‌آلات و تجهیزات جدید ممکن است نیاز به بررسی و آموزش‌های جدید داشته باشد.به همین دلیل، سازمان‌ها باید در راستای تطابق با فناوری‌های نوین، برنامه‌های آموزشی و ایمنی خود را به‌روز کنند.

    نتیجه‌گیری

چالش‌های ایمنی در محل کار می‌توانند به اشکال مختلف نمایان شوند، اما توجه به این چالش‌ها و اجرای راهکارهای مؤثر می‌تواند ایمنی و سلامت کارکنان را بهبود بخشد.ایجاد محیطی ایمن و حمایت‌گر نه تنها به حفظ سلامتی کارکنان کمک می‌کند بلکه بر کارایی و بهره‌وری سازمان نیز تأثیر مثبت خواهد گذاشت.در نهایت، حفظ ایمنی در محل کار باید به‌عنوان یک اولویت‌ اصلی در همه سازمان‌ها در نظر گرفته شود. 
`
        },
        {
            id: 2,
            title: "ایمنی در ورزش: راهنمایی برای فعالیت‌های سالم",
            descr: "ایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد. ",
            link: "/article/2",
            poster: "../../assets/images/ar2.jpg",
            text: `ورزش یکی از بهترین راه‌ها برای حفظ سلامتی جسمی و روحی است، اما برای بهره‌مندی حداکثری از آن، توجه به ایمنی بسیار اهمیت دارد. در این مقاله، به بررسی نکات کلیدی برای ایمنی در ورزش خواهیم پرداخت.

 اهمیت ایمنی در ورزش

ایمنی در ورزش نه تنها به جلوگیری از آسیب‌های جسمی کمک می‌کند، بلکه اعتماد به نفس ورزشکاران را نیز افزایش می‌دهد. با رعایت اصول ایمنی، می‌توان از بروز آسیب‌های جدی و غیرضروری جلوگیری کرد.

 انتخاب محیط مناسب

انتخاب محیط مناسب برای ورزش یکی از ابتدایی‌ترین نکات ایمنی است. فضای ورزشی باید تمیز، بدون موانع و با تجهیزات مناسب باشد. زمین‌های ورزشی باید نرم و بدون سنگ و خرده شیشه باشند تا در صورت سقوط، آسیب کمتری به ورزشکار وارد شود.

 استفاده از تجهیزات ایمنی

استفاده از تجهیزات ایمنی مناسب می‌تواند خطر آسیب را به طرز چشمگیری کاهش دهد. برای مثال:
- در ورزش‌هایی مانند دوچرخه‌سواری، کلاه ایمنی بهترین راه برای حفاظت از سر است.
- در ورزش‌های رزمی، استفاده از دستکش‌ها و محافظ‌های بدن می‌تواند از آسیب‌های جدی جلوگیری کند.

 گرم کردن و سرد کردن

گرم کردن قبل از ورزش و سرد کردن بعد از آن، بسیار حائز اهمیت است. گرم کردن به بدن کمک می‌کند تا به تدریج به فعالیت‌های ورزشی عادت کند و از بروز کشیدگی و آسیب‌های عضلانی جلوگیری می‌کند. سرد کردن نیز به بازگشت قلب و عضلات به حالت اولیه کمک می‌کند و خطر آسیب‌ها را کاهش می‌دهد.

 تمرینات مناسب

انتخاب تمرینات متناسب با سطح فیزیکی و توانایی‌های خود، از نکات کلیدی در ایمنی است. شروع با تمرینات سبک و افزایش تدریجی شدت و زمان تمرین، کمک می‌کند که بدن به تدریج به فشارهای ورزشی عادت کند.

 توجه به علائم بدن

هرگز نباید علائم خستگی یا دردهای غیرعادی را نادیده گرفت. در صورت احساسی از درد، خطر آسیب وجود دارد. هر ورزشکاری باید به واکنش‌های بدن خود توجه کند و در صورت نیاز، فعالیت را متوقف کند و به پزشک مراجعه نماید.

 مشاوره با متخصصان

برای افراد تازه‌کار یا کسانی که به ورزشی خاص علاقه‌مند هستند، مشاوره با مربی یا متخصص ورزشی می‌تواند مفید واقع شود. آن‌ها می‌توانند راهنمایی‌های لازم در زمینه تکنیک‌های صحیح انجام حرکات، انتخاب تجهیزات مناسب و برنامه‌ریزی برای تمرینات ارائه دهند.

 تغذیه مناسب

تغذیه صحیح قبل و بعد از ورزش می‌تواند به بهبود عملکرد و تسریع روند بهبودی کمک کند. مصرف مواد مغذی مناسب، هیدراتاسیون کافی و رعایت زمان‌های مناسب برای تغذیه، از نکات کلیدی در این زمینه هستند.

 نتیجه‌گیری

ایمنی در ورزش به معنای پیشگیری از آسیب‌ها و ارتقای کیفیت تمرینات است. با رعایت نکات فوق، می‌توان تجربه‌ای سالم و ایمن از ورزش داشت و از فواید سلامت‌ساز آن بهره‌مند شد. ورزش تنها زمانی لذت‌بخش و مؤثر است که با ایمنی همراه باشد؛ پس همواره باید این نکات را مد نظر قرار داد و با آگاهی و احتیاط به این فعالیت پرداخته شود.
`
        },
    ])



    return { articles, navMenu, carousel };
})