<template>
    <div class="w-[60%] max-sm:w-full border dark:border-zinc-700 bg-gray-100 dark:bg-zinc-800 shadow-md p-5 text-sm leading-6"
        style="direction: rtl;">
        <div class="text-lg" style="direction: rtl;">
            فواید عضویت
        </div>
        آسیب یار به عنوان مرجع اطلاع رسانی و آموزش و پیشگیری و ایمنی از
        حوادث، از مراکز تروما و متخصصان گرفته تا بیماران و خانواده‌هایی که از آن‌ها مراقبت می‌کنند، با اعضای خود
        همکاری
        می‌کند تا اطمینان حاصل کند که بهترین اطلاعات و آمادگی را برای ارائه مراقبت پزشکی بی‌نظیر در جوامع خود دارند.
        آسیب یار اطلاعات حیاتی در مورد تروما را به اعضای خود، سیاست‌گذاران و عموم مردم ارائه می‌دهد و در عین حال
        نیازهای
        خانواده‌ها را حمایت می‌کند. ما حامی قوی پیشگیری از آسیب هستیم و برنامه‌هایی را برای کاهش تأثیر بیماری و مرگ
        و
        میر در کشورمان ایجاد و تولید می‌کنیم.

        آسیب یار شما را دعوت می‌کند تا به ما بپیوندید و به پیشبرد مأموریت ما کمک کنید. بیایید کیفیت مراقبت از تروما
        را
        شکل دهیم تا اطمینان حاصل کنیم که همه به مراقبت مناسب، در مکان مناسب و در زمان مناسب دسترسی دارند.

    </div>
</template>

<script setup>

</script>

<style></style>