<template>
    <div class="w-full min-h-screen pt-[139px] grid items-center">
        <div class="mx-auto lg:w-[50%] md:w-[70%] sm:w-[80%] max-sm:w-[100%] border dark:border-zinc-700 bg-gray-100 dark:bg-zinc-800 dark:max-sm:bg-zinc-700 shadow-md dark:max-sm:shadow-none p-5 text-sm leading-6"
            style="direction: rtl;">
            <div class="text-lg" style="direction: rtl;">
                درباره ما
            </div>
            ماوا در لغت یعنی مکان امن، پناهگاه و آشیانه. جایی که شما احساس امنیت و آسایش می‌کنید. چیزی که با همراهی ما
            می‌توانید آن را تجربه کنید. مرجع اطلاع رسانی و آموزش ایمنی به اختصار ماوای ایمنی، یک وبسایت اطلاع رسانی و
            آموزشی در زمینه آسیب دیدگی، تروما، پیشگیری و ایمنی است که برای طیف گسترده‌ای از افراد جامعه، راه‌اندازی شده
            تا بستری را جهت دستیابی هرچه سریعتر افراد جامعه به اخبار و آموزش‌های مناسب و با کیفیت در خصوص تروما و نحوه
            پیشگیری از آن فراهم آورد. هدف ما از طراحی این بستر فراهم آوردن اطلاعاتی به‌روز، مفید و کاربردی جهت تامین
            امنیت شما در حوادث مختلف زندگی است. امروزه به دلیل افزایش جمعیت و به دنبال آن افزایش تعداد وسایل نقلیه , حمل
            و نقل جاده‌ای، متاسفانه شاهد افزایش تصادفات و سوانح ناخوشایند وسایل نقلیه هستیم. به طوری که به گزارش مرکز
            ملی کنترل و پیشگیری از بیماری‌ها، حوادث و سوانح وسایل نقلیه، سومین دلیل مرگ و میر را تشکیل می‌دهند. از سویی
            دیگر گسترش فعالیت‌های ورزشی و برگزارش مسابقات و رویدادهای مختلف در حوزه‌های ورزشی، سبب افزایش آسیب دیدگی و
            ترومای ناشی از فعالیت‌های ورزشی شده است. نرخ روبه رشد جمعیت در سطح جهان، سبب فزایش نیاز به ساختمان سازی و و
            فراهم کردن مسکن شده‌است که به دنبال فراهم آوردن این نیاز، شاهد افزایش حوادث کار و آسیب دیدگی کارگران
            ساختمانی هستیم. موارد مطرح شده تنها تعداد اندکی از هزاران سانحه و حادثه ناخوشایندی است که روزانه در جهان رخ
            می‌دهند. ماوای ایمنی‌، در کنار شما هست، تا با ارائه جدید و به‌روزترین اخبار آموزش‌ها در خصوص تروما و پیشگیری
            از آن به شما کمک کند تا چندقدم به سوی زندگی ایمن‌تر حرکت کنید.
        </div>
    </div>
</template>

<script setup>

</script>

<style></style>