<template>
    <div class="w-full min-h-screen">
        <div class="mx-auto mt-[200px] w-[60%] max-sm:w-[90%] border dark:border-zinc-700 bg-gray-100 dark:bg-zinc-800 shadow-md p-5 text-sm leading-6"
            style="direction: rtl;">
            <div class="text-lg" style="direction: rtl;">
                درباره ما
            </div>
            درباره ما آسیب یار، یک وبسایت اطلاع رسانی و آموزشی در زمینه آسیب دیدگی، تروما، پیشگیری و ایمنی است که برای
            طیف گسترده‌ای از افراد جامعه، راه‌اندازی شده تا بستری را جهت دستیابی هرچه سریعتر افراد جامعه به اخبار و
            آموزش‌های مناسب و با کیفیت در خصوص تروما و نحوه پیشگیری از آن فراهم آورد. امروزه به دلیل افزایش جمعیت و به
            دنبال آن افزایش تعداد وسایل نقلیه , حمل و نقل جاده‌ای، متاسفانه شاهد افزایش تصادفات و سوانح ناخوشایند
            رانندگی هستیم. به طوری که به گزارش مرکز ملی کنترل و پیشگیری از بیماری‌ها، حوادث و سوانح رانندگی، سومین دلیل
            مرگ و میر را تشکیل می‌دهند. از سویی دیگر گسترش فعالیت‌های ورزشی و برگزارش مسابقات و رویدادهای مختلف در
            حوزه‌های ورزشی، سبب افزایش آسیب دیدگی و ترومای ناشی از فعالیت‌های ورزشی شده است. نرخ روبه رشد جمعیت در سطح
            جهان، سبب فزایش نیاز به ساختمان سازی و و فراهم کردن مسکن شده‌است که به دنبال فراهم آوردن این نیاز، شاهد
            افزایش حوادث کار و آسیب دیدگی کارگران ساختمانی هستیم. موارد مطرح شده تنها تعداد اندکی از هزاران سانحه و
            حادثه ناخوشایندی است که روزانه در جهان رخ می‌دهند. آسیب یار‌، در کنار شما هست، تا با ارائه جدید و به‌روزترین
            اخبار آموزش‌ها در خصوص تروما و پیشگیری از آن به شما کمک کند تا چندقدم به سوی زندگی ایمن‌تر حرکت کنید.
        </div>
    </div>
</template>

<script setup>

</script>

<style></style>