<template>
  <div class="w-full min-h-screen pt-[169px] pb-[30px] max-sm:pt-[139px] max-sm:pb-0 grid items-center">
    <div
      class="mx-auto lg:w-[50%] md:w-[70%] sm:w-[80%] max-sm:w-[100%] border dark:border-zinc-700 bg-gray-100 dark:bg-zinc-800 dark:max-sm:bg-zinc-700 shadow-md dark:max-sm:shadow-none p-5 text-sm leading-6"
      style="direction: rtl;">
      <div class="text-lg" style="direction: rtl;">
        روز جهانی تروما
      </div>
      <div class="my-5">
        <img src="../../assets/images/11111.jpg" alt="">
      </div>
      روز جهانی تروما هر سال در تاریخ 25 مهرماه، جامعه جهانی روز جهانی تروما را گرامی می‌دارد، مناسبت مهمی که به افزایش
      آگاهی درباره تروما و تأثیر عمیق آن بر افراد و جوامع اختصاص دارد. این روز به منظور تأکید بر نیاز فوری به اقدام‌های
      پیشگیرانه و استراتژی‌های مداخله‌ای آغاز شده است و به عنوان یادآوری اهمیت پرداختن به تروما در تمام اشکال آن عمل
      می‌کند.

      تروما می‌تواند از منابع مختلفی ناشی شود، از جمله حوادث، خشونت و بلایای طبیعی. این موضوع نه تنها بر سلامت جسمی
      افراد تأثیر می‌گذارد بلکه بارهای روانی را نیز به همراه دارد که می‌تواند برای یک عمر ادامه یابد. پیامدهای اقتصادی
      نیز به طور قابل توجهی زیاد است و هزینه‌های بالای مراقبت‌های بهداشتی و از دست دادن بهره‌وری ناشی از تروماهای
      درمان‌نشده را شامل می‌شود.

      این روز خواستار تلاش‌های مشترک میان دولت‌ها، متخصصان بهداشت و سازمان‌های اجتماعی برای بهبود مراقبت از تروما و
      سیستم‌های حمایتی است. با به اشتراک‌گذاری دانش و منابع، ذینفعان می‌توانند برای توسعه استراتژی‌های مؤثر به منظور
      پیشگیری از تروما و کمک به بهبودی آسیب‌دیدگان همکاری کنند.

      در حالی که روز جهانی تروما را گرامی می‌داریم، ضروری است که محیطی را پرورش دهیم که در آن تروما به صورت آزادانه مورد
      بحث قرار گیرد و نیازمندان بتوانند به حمایت‌های لازم دسترسی پیدا کنند. ترویج آگاهی و آموزش درباره تروما در نهایت به
      جوامع سالم‌تر و مقاوم‌تر کمک خواهد کرد و مسئولیت مشترک ما را برای حفاظت و بهبود حال کسانی که در نیاز هستند تقویت
      می‌کند.

    </div>
  </div>
</template>

<script setup>

</script>

<style></style>